#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

azurerm_resource_group.resourcegroup: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg]
azurerm_user_assigned_identity.aks: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/poc-identity-aks]
azurerm_user_assigned_identity.app_gateway: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/poc-identity-app-gateway]
module.virtual_network.azurerm_virtual_network.base_network: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/virtualNetworks/poc-network]
module.virtual_network.azurerm_subnet.frontend: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/virtualNetworks/poc-network/subnets/frontend-subnet]
module.application_gateway.azurerm_public_ip.ag_public_ip: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/publicIPAddresses/poc-ag-public_ip]
module.application_gateway.azurerm_application_gateway.app_gateway: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag]
module.aks_cluster.azurerm_subnet.kubernetes_node_pool_default: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/virtualNetworks/poc-network/subnets/dev-kubernetes-nodepool-default]
module.aks_cluster.azurerm_kubernetes_cluster.aks_cluster: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.ContainerService/managedClusters/aks]
module.aks_cluster.azurerm_role_assignment.subnet_kubernetes_node_pool_default_role_assignment: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/virtualNetworks/poc-network/subnets/dev-kubernetes-nodepool-default/providers/Microsoft.Authorization/roleAssignments/cc230cd5-d424-8b67-d620-5c82f20196a5]
module.aks_cluster.azurerm_role_assignment.aks_app_gateway_rg_role_assignment_reader: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Authorization/roleAssignments/224ecbd6-b2d1-0b32-0f81-a6bc85c134c9]
module.aks_cluster.azurerm_role_assignment.aks_app_gateway_rg_role_assignement_operator: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/poc-identity-app-gateway/providers/Microsoft.Authorization/roleAssignments/95858232-8cc1-d9ec-714b-3e3a86948aee]
module.aks_cluster.azurerm_role_assignment.aks_app_gateway_rg_role_assignment_contributor: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/providers/Microsoft.Authorization/roleAssignments/c7395e50-31c9-09a7-2bec-d09b6228c8e5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.aks_cluster.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.aks_cluster.data.azurerm_user_assigned_identity.aks_ingress_application_gateway will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "aks_ingress_application_gateway" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "ingressapplicationgateway-aks"
      + principal_id        = (known after apply)
      + resource_group_name = "MC_poc-rg_aks_eastus"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # module.aks_cluster.data.azurerm_user_assigned_identity.application_gateway will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "application_gateway" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "poc-identity-app-gateway"
      + principal_id        = (known after apply)
      + resource_group_name = "poc-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # module.application_gateway.azurerm_application_gateway.app_gateway will be updated in-place
  ~ resource "azurerm_application_gateway" "app_gateway" {
        id                                = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag"
        name                              = "poc-ag"
      ~ tags                              = {
            "Maintained-By"              = "terraform"
          - "ingress-for-aks-cluster-id" = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourcegroups/poc-rg/providers/Microsoft.ContainerService/managedClusters/aks" -> null
          - "managed-by-k8s-ingress"     = "1.5.3/94b2b229/2023-02-03-21:42T+0000" -> null
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/backendAddressPools/defaultaddresspool" -> null
          - ip_addresses = [] -> null
          - name         = "defaultaddresspool" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/backendAddressPools/pool-default-release-name-lt-poc-5000-bp-5000" -> null
          - ip_addresses = [
              - "10.0.5.30",
            ] -> null
          - name         = "pool-default-release-name-lt-poc-5000-bp-5000" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "poc-ag-beap"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/backendHttpSettingsCollection/defaulthttpsetting" -> null
          - name                                = "defaulthttpsetting" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/probes/defaultprobe-Http" -> null
          - probe_name                          = "defaultprobe-Http" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - host_name                           = "ltpoc.thetagz.com" -> null
          - id                                  = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/backendHttpSettingsCollection/bp-default-release-name-lt-poc-5000-5000-release-name-lt-poc-ingress" -> null
          - name                                = "bp-default-release-name-lt-poc-5000-5000-release-name-lt-poc-ingress" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 5000 -> null
          - probe_id                            = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/probes/pb-default-release-name-lt-poc-5000-release-name-lt-poc-ingress" -> null
          - probe_name                          = "pb-default-release-name-lt-poc-5000-release-name-lt-poc-ingress" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "default-http-backend-settings"
          + path                                = "/"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "ag-frontend-port-https"
          + port = 443
        }

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/frontendIPConfigurations/ag-frontend-ip-config" -> null
          - frontend_ip_configuration_name = "ag-frontend-ip-config" -> null
          - frontend_port_id               = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/frontendPorts/ag-frontend-port-http" -> null
          - frontend_port_name             = "ag-frontend-port-http" -> null
          - host_names                     = [
              - "ltpoc.thetagz.com",
            ] -> null
          - id                             = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/httpListeners/fl-6a2ad031ae13025d054cdc5f91fe4d2b" -> null
          - name                           = "fl-6a2ad031ae13025d054cdc5f91fe4d2b" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "ag-frontend-ip-config"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "ag-frontend-port-http"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "default-http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }

      - probe {
          - host                                      = "localhost" -> null
          - id                                        = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/probes/defaultprobe-Http" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "defaultprobe-Http" -> null
          - path                                      = "/" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [] -> null
            }
        }
      - probe {
          - host                                      = "localhost" -> null
          - id                                        = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/probes/defaultprobe-Https" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "defaultprobe-Https" -> null
          - path                                      = "/" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 0 -> null
          - protocol                                  = "Https" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [] -> null
            }
        }
      - probe {
          - host                                      = "ltpoc.thetagz.com" -> null
          - id                                        = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/probes/pb-default-release-name-lt-poc-5000-release-name-lt-poc-ingress" -> null
          - interval                                  = 10 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "pb-default-release-name-lt-poc-5000-release-name-lt-poc-ingress" -> null
          - path                                      = "/" -> null
          - pick_host_name_from_backend_http_settings = false -> null
          - port                                      = 5000 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 1 -> null
          - unhealthy_threshold                       = 3 -> null

          - match {
              - status_code = [] -> null
            }
        }

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/backendAddressPools/pool-default-release-name-lt-poc-5000-bp-5000" -> null
          - backend_address_pool_name  = "pool-default-release-name-lt-poc-5000-bp-5000" -> null
          - backend_http_settings_id   = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/backendHttpSettingsCollection/bp-default-release-name-lt-poc-5000-5000-release-name-lt-poc-ingress" -> null
          - backend_http_settings_name = "bp-default-release-name-lt-poc-5000-5000-release-name-lt-poc-ingress" -> null
          - http_listener_id           = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/httpListeners/fl-6a2ad031ae13025d054cdc5f91fe4d2b" -> null
          - http_listener_name         = "fl-6a2ad031ae13025d054cdc5f91fe4d2b" -> null
          - id                         = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/requestRoutingRules/rr-6a2ad031ae13025d054cdc5f91fe4d2b" -> null
          - name                       = "rr-6a2ad031ae13025d054cdc5f91fe4d2b" -> null
          - priority                   = 19000 -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "poc-ag-beap"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "default-http-backend-settings"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "default-http-listener"
          + id                         = (known after apply)
          + name                       = "default-http-req-routing-rule"
          + priority                   = 20000
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (6 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dtags, Action: `pull_request`*